InformationRegisters/стомИзменяемыеНоменклатуройСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>стомИзменяемыеНоменклатуройСостояния</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>удалитьУдаляемоеСостояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>удалитьДобавляемоеСостояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдаляемоеСостояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДобавляемоеСостояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/стомВариантыЗубов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>стомВариантыЗубов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.стомВидыРедактированияЭлементовКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструкция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомКонструкцииЗубовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>удалитьИдентификаторКонструкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>удалитьВариантЗуба</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВидыЗубныхКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубВКарте</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантЗуба</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>удалитьЗубИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/стомСостоянияЗубов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>стомСостоянияЗубов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.стомВидыРедактированияЭлементовКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВидыЗубныхКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубВКарте</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СегментВЗубе</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСегментыЗубов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СостояниеСегмента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СегментИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/стомУчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>стомУчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтоматологическиеДиагнозы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьCtrlДляЕдиничногоВыбораЗуба</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КэшироватьДанныеЗубныхКартВПриёмах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПланыЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПланыЛечения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>удалитьДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриемовВДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дозировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗубВКарте</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СегментВЗубе</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСегментыЗубов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструкция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомКонструкцииЗубовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Comment>Документ, созданный первым в рамках одного обращения пациента</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПервичныйПрием</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭлемента</Name>
					<Comment>Собственный идентификатор элемента плана лечения</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНазначений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/стомВидыРедактированияЭлементовКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>стомВидыРедактированияЭлементовКарты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добавление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удаление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКомплексныхРасчетовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКомплексныхРасчетовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КомплекснаяПрограмма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредварительныйРасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственныйРасчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/стомВидыОбластей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>стомВидыОбластей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбластьЗуба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлементКонструкции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыМедицинскихКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыМедицинскихКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Амбулаторная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стоматологическая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стационар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГинекологическаяБеременной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>омг_СтационарРК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/стомВариантыЗубов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомВариантыЗубов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструкция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокОбластей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Область</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/стомОбновлениеИБ/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПеренестиИзменяемыеНоменклатуройСостоянияВИзмерения() Экспорт
	
	ИзмСостНЗ = РегистрыСведений.стомИзменяемыеНоменклатуройСостояния.СоздатьНаборЗаписей();
	ИзмСостНЗ.Прочитать();
	Для Каждого Запись Из ИзмСостНЗ Цикл
		Запись.ДобавляемоеСостояние = 
			?(ЗначениеЗаполнено(Запись.удалитьДобавляемоеСостояние), Запись.удалитьДобавляемоеСостояние, Запись.ДобавляемоеСостояние);
		Запись.УдаляемоеСостояние = 
			?(ЗначениеЗаполнено(Запись.удалитьУдаляемоеСостояние), Запись.удалитьУдаляемоеСостояние, Запись.УдаляемоеСостояние);	
	КонецЦикла;
	ИзмСостНЗ.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьСтандартныеЗубныеКарты() Экспорт
	
	ДанныеКарты = Справочники.стомВидыЗубныхКарт.ПолучитьМакет("СтандартныеЗубныеКарты");
	ОбщегоНазначенияСервер.ВыполнитьЗагрузкуУниверсальнымОбменомXML(ДанныеКарты, Истина);
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выполнено заполнение стандартных видов зубных карт");
	
КонецПроцедуры

Процедура ЗаполнитьВычисляемыеБлокиЗубнойКарты() Экспорт
	
	МакетыБлоков = Справочники.стомВидыЗубныхКарт.ПолучитьСписокВычисляемыхБлоков();
	Для Каждого элМакет Из МакетыБлоков Цикл
		ОбщегоНазначенияСервер.ВыполнитьЗагрузкуУниверсальнымОбменомXML(элМакет.Данные);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выполнено заполенние вычисляемых блоков зубной карты");
	
КонецПроцедуры

Процедура ЗаполнитьСостоянияПараметрыЗубов() Экспорт
	
	ДанныеСостояний = Справочники.стомВидыЗубныхКарт.ПолучитьМакет("СостоянияПараметрыЗубовПервоначальнаяЗагрузка");
	ОбщегоНазначенияСервер.ВыполнитьЗагрузкуУниверсальнымОбменомXML(ДанныеСостояний, Истина);
		
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выполнена загрузка параметров и состояний зубов");
	
КонецПроцедуры

Процедура УдалитьЛишниеСостояния() Экспорт
	
	Состояние = Справочники.стомСостоянияЗубов.НайтиПоНаименованию("Ржавый", Ложь);
	Если Не Состояние.Пустая() Тогда
		мсСсылки = Новый Массив;
		мсСсылки.Добавить(Состояние);
		Если НайтиПоСсылкам(мсСсылки) = Неопределено Тогда 
			Состояние.ПолучитьОбъект().Удалить();
		Иначе
			Состояние.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура РеструктуризацияВариантовЗубныхКарт() Экспорт
	
	//удаление областей, которых не может быть в составе вариантов при новых настройках
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	стомВариантыЗубовСписокОбластей.Ссылка КАК ВариантЗуба,
	|	стомВариантыЗубовСписокОбластей.Область КАК Область
	|ПОМЕСТИТЬ ОбластиВариантов
	|ИЗ
	|	Справочник.стомВариантыЗубов.СписокОбластей КАК стомВариантыЗубовСписокОбластей
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВариантЗуба,
	|	Область
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриемстомУстановленныеВарианты.Ссылка КАК Прием,
	|	ПриемстомУстановленныеВарианты.НомерСтроки
	|ИЗ
	|	Документ.Прием.стомУстановленныеВарианты КАК ПриемстомУстановленныеВарианты
	|ГДЕ
	|	ПриемстомУстановленныеВарианты.Область <> ЗНАЧЕНИЕ(Справочник.стомОбластиСегментов.)
	|			И НЕ (ПриемстомУстановленныеВарианты.ВариантЗуба, ПриемстомУстановленныеВарианты.Область) В
	|					(ВЫБРАТЬ
	|						ОбластиВариантов.ВариантЗуба,
	|						ОбластиВариантов.Область
	|					ИЗ
	|						ОбластиВариантов КАК ОбластиВариантов)
	|ИТОГИ ПО
	|	Прием";
	Результат = Запрос.Выполнить();
	ВыборкаПрием = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПрием.Следующий() Цикл
		
		ПриемОбъект = ВыборкаПрием.Прием.ПолучитьОбъект();
		ВыборкаСтроки = ВыборкаПрием.Выбрать();
		мсСтрокиКУдалению = Новый Массив;
		Пока ВыборкаСтроки.Следующий() Цикл
			мсСтрокиКУдалению.Добавить(ПриемОбъект.стомУстановленныеВарианты[ВыборкаСтроки.НомерСтроки - 1]);
		КонецЦикла;
		
		Для Каждого элСтрока Из мсСтрокиКУдалению Цикл 
			ПриемОбъект.стомУстановленныеВарианты.Удалить(элСтрока);
		КонецЦикла;
		
		РежимЗаписи = ?(ПриемОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
		ПриемОбъект.стомУстановленныеВарианты.Свернуть("ЗубВКарте, ВариантЗуба, Область, ТипУстановки, ВидРедактирования");
		ПриемОбъект.Записать(РежимЗаписи);
		
	КонецЦикла;
	
	//конвертирование вариантов "Абатмент" и "Штифт" на имплантацию
	ВариантАбатмент = Справочники.стомВариантыЗубов.НайтиПоНаименованию("Абатмент");
	ВариантШтифт = Справочники.стомВариантыЗубов.НайтиПоНаименованию("Штифт");
	ВариантИмплант = Справочники.стомВариантыЗубов.НайтиПоНаименованию("Имплантация");
	ВариантОтсутствует = Справочники.стомВариантыЗубов.НайтиПоНаименованию("Отсутствует");
	
	мсИскомыеВарианты = Новый Массив;
	мсИскомыеВарианты.Добавить(ВариантАбатмент);
	мсИскомыеВарианты.Добавить(ВариантШтифт);
	мсИскомыеВарианты.Добавить(ВариантИмплант);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриемстомУстановленныеВарианты.Ссылка КАК Прием
	|ИЗ
	|	Документ.Прием.стомУстановленныеВарианты КАК ПриемстомУстановленныеВарианты
	|ГДЕ
	|	ПриемстомУстановленныеВарианты.ВариантЗуба В(&СписокВариантов)";
	Запрос.УстановитьПараметр("СписокВариантов", мсИскомыеВарианты);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПриемОбъект = Выборка.Прием.ПолучитьОбъект();
		//ПриемОбъект = Документы.Прием.СоздатьДокумент(); 
		Для Каждого СтрокаВариант Из ПриемОбъект.стомУстановленныеВарианты.НайтиСтроки(Новый Структура("ВариантЗуба", ВариантАбатмент)) Цикл
			СтрокаВариант.ВариантЗуба = ВариантИмплант;
		КонецЦикла;
		Для Каждого СтрокаВариант Из ПриемОбъект.стомУстановленныеВарианты.НайтиСтроки(Новый Структура("ВариантЗуба", ВариантШтифт)) Цикл
			СтрокаВариант.ВариантЗуба = ВариантИмплант;
		КонецЦикла;
		Для Каждого СтрокаВариант Из ПриемОбъект.стомУстановленныеВарианты.НайтиСтроки(Новый Структура("ВариантЗуба", ВариантИмплант)) Цикл
			СтрокаВариант.ВариантЗуба = ВариантИмплант;
		КонецЦикла;
		Для Каждого СтрокаВариант Из ПриемОбъект.стомУстановленныеВарианты.НайтиСтроки(Новый Структура("ВариантЗуба", ВариантОтсутствует)) Цикл
			СтрокаВариант.Область = Неопределено;
		КонецЦикла;
		
		Для Каждого СтрокаВариант Из ПриемОбъект.стомУстановленныеВарианты.НайтиСтроки(Новый Структура("ВариантЗуба", ВариантИмплант)) Цикл
			НоваяСтрока = ПриемОбъект.стомУстановленныеВарианты.Добавить();
			НоваяСтрока.ЗубВКарте = СтрокаВариант.ЗубВКарте;
			НоваяСтрока.ВариантЗуба = ВариантОтсутствует;
			НоваяСтрока.ТипУстановки = СтрокаВариант.ТипУстановки;
			НоваяСтрока.ВидРедактирования = Перечисления.стомВидыРедактированияЭлементовКарты.Добавление;
		КонецЦикла;
		
		РежимЗаписи = ?(ПриемОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
		ПриемОбъект.Записать(РежимЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СконвертироватьЗаказыКлиентовВКомплексныеРасчеты() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КомплексныйРасчетКлиента.Ссылка КАК КомплексныйРасчет
	|ИЗ
	|	Документ.КомплексныйРасчетКлиента КАК КомплексныйРасчетКлиента
	|ГДЕ
	|	НЕ КомплексныйРасчетКлиента.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	// Создание вида расчета
	ВидРасчета = Неопределено;
	ВыбВидыРасчетов = Справочники.ВидыКомплексныхРасчетовКлиентов.Выбрать();
	Пока ВыбВидыРасчетов.Следующий() Цикл
		Если Не ВыбВидыРасчетов.ЭтоГруппа
			И ВыбВидыРасчетов.Тип = Перечисления.ТипыКомплексныхРасчетовКлиентов.ПроизводственныйРасчет
		Тогда
			ВидРасчета = ВыбВидыРасчетов.Ссылка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ВидРасчета) Тогда
		ВидРасчетаОбъект = Справочники.ВидыКомплексныхРасчетовКлиентов.СоздатьЭлемент();
		ВидРасчетаОбъект.Наименование = "Зуботехнический заказ-наряд";
		ВидРасчетаОбъект.Тип = Перечисления.ТипыКомплексныхРасчетовКлиентов.ПроизводственныйРасчет;
		ВидРасчетаОбъект.ЭтоЗуботехническийЗаказНаряд = Истина;
		ВидРасчетаОбъект.РазрешитьПродажуНеПоЦенеРасчета = Истина;
		ВидРасчетаОбъект.Прейскурант = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойПрейскурант");
		ВидРасчетаОбъект.Записать();
		ВидРасчета = ВидРасчетаОбъект.Ссылка;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		РасчетКлиента = Выборка.КомплексныйРасчет.ПолучитьОбъект();
		РасчетКлиента.Вид = ВидРасчета;
		РасчетКлиента.Прейскурант = ВидРасчета.Прейскурант;
		
		Если ЗначениеЗаполнено(РасчетКлиента.удалитьНоменклатура) Тогда
			НоваяСтрока = РасчетКлиента.Состав.Добавить();
			НоваяСтрока.Номенклатура = РасчетКлиента.удалитьНоменклатура;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = РасчетКлиента.удалитьСуммаДокумента;
			НоваяСтрока.Сумма = РасчетКлиента.удалитьСуммаДокумента;
			
			РасчетКлиента.удалитьНоменклатура = Неопределено;
		КонецЕсли;
		
		Попытка
			РасчетКлиента.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			РасчетКлиента.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура РеструктуризоватьКонструкцииЗубовКлиентов() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриемстомУстановленныеВарианты.Ссылка КАК ДокПрием
	|ПОМЕСТИТЬ ПриемыСКонструкциями
	|ИЗ
	|	Документ.Прием.стомУстановленныеВарианты КАК ПриемстомУстановленныеВарианты
	|ГДЕ
	|	ПриемстомУстановленныеВарианты.Конструкция <> ЗНАЧЕНИЕ(Справочник.стомКонструкцииЗубовКлиентов.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокПрием
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриемыСКонструкциями.ДокПрием КАК ДокПрием,
	|	ПриемстомУстановленныеВарианты.ЗубВКарте,
	|	ПриемстомУстановленныеВарианты.ВариантЗуба,
	|	ВЫБОР
	|		КОГДА ПриемстомУстановленныеВарианты.Область.ВидОбласти = ЗНАЧЕНИЕ(Перечисление.стомВидыОбластей.ЭлементКонструкции)
	|			ТОГДА ПриемстомУстановленныеВарианты.Область.КонструкцияРодитель
	|		ИНАЧЕ ПриемстомУстановленныеВарианты.Область
	|	КОНЕЦ КАК Область,
	|	ПриемстомУстановленныеВарианты.Конструкция,
	|	ПриемстомУстановленныеВарианты.ТипУстановки,
	|	ПриемстомУстановленныеВарианты.ВидРедактирования
	|ИЗ
	|	ПриемыСКонструкциями КАК ПриемыСКонструкциями
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Прием.стомУстановленныеВарианты КАК ПриемстомУстановленныеВарианты
	|		ПО ПриемыСКонструкциями.ДокПрием = ПриемстомУстановленныеВарианты.Ссылка
	|ГДЕ
	|	ПриемыСКонструкциями.ДокПрием.ЗубнаяКарта <> ЗНАЧЕНИЕ(Справочник.стомВидыЗубныхКарт.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриемыСКонструкциями.ДокПрием.МоментВремени
	|ИТОГИ ПО
	|	ДокПрием";
	
	Результат = Запрос.Выполнить();
	ВыборкаПриемы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПриемы.Следующий() Цикл
		
		ДокОбъект = ВыборкаПриемы.ДокПрием.ПолучитьОбъект();
		Если Ложь Тогда ДокОбъект = Документы.Прием.СоздатьДокумент(); КонецЕсли;
		
		АдресЗК = стомЗубнаяКартаИнициализация.ИнициализироватьЗубнуюКарту(
		ДокОбъект.ЗубнаяКарта, ДокОбъект.Клиент, , ДокОбъект.Дата, ДокОбъект.ВариантЗубнойКарты, ДокОбъект.Ссылка);
		
		
		ГраницаПрием = Новый Граница(ДокОбъект.МоментВремени(), ВидГраницы.Исключая);		
		ИзмененныеВариантыСостоянияОбозначения = стомЗубнаяКартаДокументы.ПолучитьИзмененныеВариантыСостоянияОбозначения(АдресЗК, ГраницаПрием);
		ДокОбъект.стомУстановленныеВарианты.Загрузить(ИзмененныеВариантыСостоянияОбозначения.Варианты);
		ДокОбъект.стомУстановленныеСостояния.Загрузить(ИзмененныеВариантыСостоянияОбозначения.Состояния);
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если ДокОбъект.Проведен Тогда 
			ВариантыЗубовНЗ = РегистрыСведений.стомВариантыЗубов.СоздатьНаборЗаписей();
			ВариантыЗубовНЗ.Отбор.Регистратор.Установить(ДокОбъект.Ссылка);
			Для Каждого СтрокаВариант Из ДокОбъект.стомУстановленныеВарианты Цикл
				
				ДобавлятьСтроку = Истина;
				
				ВариантыЗубовНЗ.Прочитать();
				Для Каждого Строка Из ВариантыЗубовНЗ Цикл
					Если Строка.Клиент = ДокОбъект.Клиент
						И Строка.ЗубнаяКарта = ДокОбъект.ЗубнаяКарта
						И Строка.ЗубВКарте = СтрокаВариант.ЗубВКарте
						И Строка.ВариантЗуба = СтрокаВариант.ВариантЗуба
						И Строка.Область = СтрокаВариант.Область
					Тогда
						Строка.ВидРедактирования = СтрокаВариант.ВидРедактирования;
						Строка.Конструкция = СтрокаВариант.Конструкция;
						Строка.удалитьИдентификаторКонструкции = СтрокаВариант.удалитьИдентификаторКонструкции;
						
						ДобавлятьСтроку = Ложь
					КонецЕсли;	
				КонецЦикла;
				
				Если ДобавлятьСтроку Тогда
					ВариантыЗубовЗапись = ВариантыЗубовНЗ.Добавить();
					ЗаполнитьЗначенияСвойств(ВариантыЗубовЗапись, СтрокаВариант);
					ВариантыЗубовЗапись.Регистратор = ДокОбъект.Ссылка;
					ВариантыЗубовЗапись.Период = ДокОбъект.Дата;
					ВариантыЗубовЗапись.Клиент = ДокОбъект.Клиент;
					ВариантыЗубовЗапись.ЗубнаяКарта = ДокОбъект.ЗубнаяКарта;
				КонецЕсли;
			КонецЦикла;
			ВариантыЗубовНЗ.Записать();
			
			СостоянияЗубовНЗ = РегистрыСведений.стомСостоянияЗубов.СоздатьНаборЗаписей();
			СостоянияЗубовНЗ.Отбор.Регистратор.Установить(ДокОбъект.Ссылка);
			Для Каждого СтрокаСостояние Из ДокОбъект.стомУстановленныеСостояния Цикл
				СостоянияЗубовЗапись = СостоянияЗубовНЗ.Добавить();
				ЗаполнитьЗначенияСвойств(СостоянияЗубовЗапись, СтрокаСостояние);
				СостоянияЗубовЗапись.Регистратор = ДокОбъект.Ссылка;
				СостоянияЗубовЗапись.Период = ДокОбъект.Дата;
				СостоянияЗубовЗапись.Клиент = ДокОбъект.Клиент;
				СостоянияЗубовЗапись.ЗубнаяКарта = ДокОбъект.ЗубнаяКарта;
			КонецЦикла;
			СостоянияЗубовНЗ.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаменитьНеиспользуемыеМакетыМедкарт() Экспорт 
	
	СоответствиеНазваний = Новый Соответствие;
	СоответствиеНазваний.Вставить("АмбулаторнаяКарта043у_А5_приказ834н",	"стомАмбулаторнаяКарта043У");
	СоответствиеНазваний.Вставить("АмбулаторнаяКарта043У",					"стомАмбулаторнаяКарта043У");
	СоответствиеНазваний.Вставить("АмбулаторнаяКартаОртопедия043У_А4_приказ834н",	"стомМедицинскаяКартаОртодонтия043_1У");
	СоответствиеНазваний.Вставить("МедицинскаяКартаОртодонтия043_1У", 				"стомМедицинскаяКартаОртодонтия043_1У");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыМедицинскихКарт.Ссылка КАК ВидМедкарты,
	|	ВидыМедицинскихКарт.Макет
	|ИЗ
	|	Справочник.ВидыМедицинскихКарт КАК ВидыМедицинскихКарт
	|ГДЕ
	|	НЕ ВидыМедицинскихКарт.ИспользуетсяВнешняяПФ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.Макет) = Тип("Строка") И ЗначениеЗаполнено(Выборка.Макет) Тогда 
			НовыйМакет = СоответствиеНазваний.Получить(Выборка.Макет);
			Если НовыйМакет <> Неопределено Тогда
				ВидМедкартыОбъект = Выборка.ВидМедкарты.ПолучитьОбъект();
				ВидМедкартыОбъект.Макет = НовыйМакет;
				ВидМедкартыОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПеренестиОбозначенияЗубовВСписокВариантов() Экспорт 
	
	ВыборкаЗубы = Справочники.стомВидыЗубов.Выбрать();
	Пока ВыборкаЗубы.Следующий() Цикл
		
		ЗубОбъект = ВыборкаЗубы.ПолучитьОбъект();
		ЗубОбъект.ОбменДанными.Загрузка = Истина;
		Для Каждого СтрокаОбозначение Из ЗубОбъект.удалитьОбозначенияЗуба Цикл
			Если Не ЗначениеЗаполнено(СтрокаОбозначение.Обозначение) Тогда 
				Продолжить;
			КонецЕсли;
			СтрокаВариант = ЗубОбъект.СписокВариантов.Найти(СтрокаОбозначение.ОсновнойВариант, "ВариантЗуба");
			Если СтрокаВариант = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			СтрокаВариант.Обозначение = СтрокаОбозначение.Обозначение;
		КонецЦикла;
		ЗубОбъект.удалитьОбозначенияЗуба.Очистить();
		ЗубОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПеренестиНастройкиУчетнойПолитики() Экспорт 
	
	УчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику(Ложь);
	СтруктураНастроек = Новый Структура("СтоматологическиеДиагнозы, ИспользоватьCtrlПриМножественномВыделенииЗубов", УчетнаяПолитика.удалитьГруппаСтомДиагнозов, Истина);
	РегистрыСведений.стомУчетнаяПолитика.УстановитьНастройки(СтруктураНастроек);
	
КонецПроцедуры

Процедура УстановитьНастройкуКэшированияЗК() Экспорт
	
	РегистрыСведений.стомУчетнаяПолитика.УстановитьНастройки(Новый Структура("КэшироватьДанныеЗубныхКартВПриёмах", Истина));
	
КонецПроцедуры

Процедура СоздатьВидМедкартыОртодонта_043_1У_СПараметрами() Экспорт
	
	// Проверим Наличие медкарты Оротодонта 043-1/у
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Макет", "стомМедицинскаяКартаОртодонтия043_1У_ПолнаяСПараметрами%");
	Запрос.Текст =                                              
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыМедицинскихКарт.Ссылка
	|ИЗ
	|	Справочник.ВидыМедицинскихКарт КАК ВидыМедицинскихКарт
	|ГДЕ
	|	ВидыМедицинскихКарт.Макет ПОДОБНО &Макет";
	Выб = Запрос.Выполнить().Выбрать();
	
	Если Не Выб.Следующий() Тогда
		Медкарта043_1у = Справочники.ВидыМедицинскихКарт.СоздатьЭлемент();
		Медкарта043_1у.Наименование = "Ортодонтическая карта 043-1/у";
		Медкарта043_1у.Макет = "стомМедицинскаяКартаОртодонтия043_1У_ПолнаяСПараметрами";
		Медкарта043_1у.ТипКарты = Перечисления.ТипыМедицинскихКарт.Стоматологическая;
		Медкарта043_1у.Записать();
	КонецЕсли;	
	
КонецПроцедуры

Процедура Стоматология_ОбновитьСегментыЗубныхКарт_29_1() Экспорт
	
	// Загрузка новой зубной карты
	ОбщегоНазначенияСервер.ВыполнитьЗагрузкуУниверсальнымОбменомXML(Справочники.стомВидыЗубныхКарт.ПолучитьМакет("СтандартныеЗубныеКарты"), Истина);
	
	// Обновление сегментов в документах
	
	// 1. Кеши данных для подмены
	
	// Кеш зубы карты
	ЗубыВКарте = Новый Соответствие;
	Выб = Справочники.стомЗубыКарты.Выбрать();
	Пока Выб.Следующий() Цикл
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Выб.Наименование) Тогда
			Попытка
				НомерЗубаЧисло = (Число(Выб.Наименование))% 10;
			Исключение
				НомерЗубаЧисло = Неопределено;
			КонецПопытки;
			
			Попытка
				ЧастьЧелюсти = Цел(Число(Выб.Наименование)/10);
			Исключение КонецПопытки;
			
			Если НомерЗубаЧисло <> Неопределено Тогда
				ЗубыВКарте.Вставить(Выб.Ссылка, Новый Структура("Наименование, Зуб, НомерЗуба, ЧастьЧелюсти", Выб.Наименование, Выб.Зуб, НомерЗубаЧисло, ЧастьЧелюсти));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Кеш Сегменты зубов
	НаименованияЗаменяемыхОбщихСегментов = ОбщегоНазначенияКлиентСервер.НовыйМассив("Вестибулярная поверхность", "Окклюзионная поверхность", "Оральная поверхность");
	ЗаменяемыеСегменты	  = Новый Массив;
	НаименованияСегментов = Новый Соответствие;
	Выб = Справочники.стомСегментыЗубов.Выбрать();
	Пока Выб.Следующий() Цикл
		НаименованияСегментов.Вставить(Выб.Ссылка, Выб.Наименование);
		
		Если ТипЗнч(Выб.Владелец) = Тип("СправочникСсылка.стомВидыЗубныхКарт")
			И НаименованияЗаменяемыхОбщихСегментов.Найти(Выб.Наименование) <> Неопределено
		Тогда
			ЗаменяемыеСегменты.Добавить(Выб.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	// Получить все новые поверхности по зубам, на которые заменяем старые
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	стомСегментыЗубов.Владелец КАК Владелец,
	|	стомСегментыЗубов.Наименование КАК Наименование,
	|	стомСегментыЗубов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.стомСегментыЗубов КАК стомСегментыЗубов
	|ГДЕ
	|	(стомСегментыЗубов.Сегмент.Наименование = ""ПоверхностьКрай""
	|			ИЛИ стомСегментыЗубов.Сегмент.Наименование = ""ПоверхностьЦентр"")
	|	И НЕ стомСегментыЗубов.ПометкаУдаления
	|	И стомСегментыЗубов.Владелец ССЫЛКА Справочник.стомВидыЗубов";
	
	// Сохраняем поверхности в таблице для дальнейшего поиска по ней
	ТаблицаНовыхПоверхностейПоЗубам = Запрос.Выполнить().Выгрузить();
	
	// Таблица правил замены сегментов
	ТаблицаСоответствийЗамены = Новый ТаблицаЗначений;
	ТаблицаСоответствийЗамены.Колонки.Добавить("ЗубВКарте");
	ТаблицаСоответствийЗамены.Колонки.Добавить("ЗаменяемыйСегмент");
	ТаблицаСоответствийЗамены.Колонки.Добавить("НовыйСегмент");
	Для Каждого кзЗубВКарте Из ЗубыВКарте Цикл
		Для Каждого ЗаменяемыйСегмент Из ЗаменяемыеСегменты Цикл
			
			Зуб = кзЗубВКарте.Значение.Зуб;
			НомерЗубаТекСтроки	 = кзЗубВКарте.Значение.НомерЗуба;
			ЧастьЧелюсти		 = кзЗубВКарте.Значение.ЧастьЧелюсти;
			НаименованиеВстроенногоНовогоСегмента = "";
			
			// Если это старый сегмент под замену, то проверяем на каком он зубе и получаем ссылку на нужную замену
			//(обработка работает один раз, поэтому Вестибулярная поверхность всегда будет старой).
			ИмяСегментаЗубаТекСтроки = НаименованияСегментов.Получить(ЗаменяемыйСегмент);
			
			Если ИмяСегментаЗубаТекСтроки = "Вестибулярная поверхность" Тогда
				
				// Это вестибулярная поверхность
				// вестибулярная поверхность - 11-13, 21-23, 31-33, 41-43; щечная поверхность 14-18, 24-28, 34-38, 44-48.
				Если НомерЗубаТекСтроки < 4 Тогда
					НаименованиеВстроенногоНовогоСегмента = "Вестибулярная поверхность";
				Иначе
					НаименованиеВстроенногоНовогоСегмента = "Щечная поверхность";
				КонецЕсли;
				
			ИначеЕсли ИмяСегментаЗубаТекСтроки = "Окклюзионная поверхность" Тогда
				
				// Это Окклюзионная поверхность - центр
				// Режущи край - 11-13, 21-23, 31-33, 41-43; Жевательная поверхность 14-18, 24-28, 34-38, 44-48
				Если НомерЗубаТекСтроки < 4 Тогда
					НаименованиеВстроенногоНовогоСегмента = "Режущий край";
				Иначе
					НаименованиеВстроенногоНовогоСегмента = "Жевательная поверхность";
				КонецЕсли;
				
			ИначеЕсли ИмяСегментаЗубаТекСтроки = "Оральная поверхность" Тогда
				
				// Это Оральная поверхность
				// небная поверхность - 11-18, 21-28; язычная поверхность 31-38, 41-48
				Если ЧастьЧелюсти < 3 Тогда
					НаименованиеВстроенногоНовогоСегмента = "Небная поверхность";
				Иначе
					НаименованиеВстроенногоНовогоСегмента = "Язычная поверхность";
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ПустаяСтрока(НаименованиеВстроенногоНовогоСегмента) Тогда
				СтрокаЗамены = ТаблицаСоответствийЗамены.Добавить();
				СтрокаЗамены.ЗубВКарте			 = кзЗубВКарте.Ключ;
				СтрокаЗамены.ЗаменяемыйСегмент	 = ЗаменяемыйСегмент;
				СтрокаЗамены.НовыйСегмент		 = ТаблицаНовыхПоверхностейПоЗубам.НайтиСтроки(Новый Структура("Владелец, Наименование", Зуб, НаименованиеВстроенногоНовогоСегмента))[0].Ссылка;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ОтборПравилаЗамены = Новый Структура("ЗубВКарте, ЗаменяемыйСегмент");
	
 	// 2. Регистр состояний зубов и его приемы
	
	// Собственно выбор данных и подмена.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаменяемыеСегменты", ЗаменяемыеСегменты);
	
	// Перебор большого регистра состояний зубов
	Для СчИтераций = 1 По 25000 Цикл
		
		НачатьТранзакцию();
		
		// Запрос по 
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
			|	стомСостоянияЗубов.Регистратор КАК Регистратор
			|ПОМЕСТИТЬ Регистраторы
			|ИЗ
			|	РегистрСведений.стомСостоянияЗубов КАК стомСостоянияЗубов
			|ГДЕ
			|	стомСостоянияЗубов.СегментВЗубе В(&ЗаменяемыеСегменты)
			|	И ТИПЗНАЧЕНИЯ(стомСостоянияЗубов.Регистратор) = ТИП(Документ.Прием)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	стомСостоянияЗубов.Период КАК Период,
			|	стомСостоянияЗубов.Регистратор КАК Регистратор,
			|	стомСостоянияЗубов.НомерСтроки КАК НомерСтроки,
			|	стомСостоянияЗубов.Активность КАК Активность,
			|	стомСостоянияЗубов.Клиент КАК Клиент,
			|	стомСостоянияЗубов.ЗубнаяКарта КАК ЗубнаяКарта,
			|	стомСостоянияЗубов.ЗубВКарте КАК ЗубВКарте,
			|	стомСостоянияЗубов.СегментВЗубе КАК СегментВЗубе,
			|	стомСостоянияЗубов.СостояниеСегмента КАК СостояниеСегмента,
			|	стомСостоянияЗубов.ЗубИдентификатор КАК ЗубИдентификатор,
			|	стомСостоянияЗубов.СегментИдентификатор КАК СегментИдентификатор,
			|	стомСостоянияЗубов.ВидРедактирования КАК ВидРедактирования
			|ИЗ
			|	РегистрСведений.стомСостоянияЗубов КАК стомСостоянияЗубов
			|ГДЕ
			|	стомСостоянияЗубов.Регистратор В
			|			(ВЫБРАТЬ
			|				Регистраторы.Регистратор
			|			ИЗ
			|				Регистраторы)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Регистраторы.Регистратор КАК Регистратор
			|ИЗ
			|	Регистраторы КАК Регистраторы";
			
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		// Если нечего перезаписывать - прекращаем работу
		Если РезультатыЗапроса[1].Пустой() Тогда
			Прервать;
		КонецЕсли;	
		
		ТаблицаРегистраСостоянийСегментовЗубов = РезультатыЗапроса[1].Выгрузить();
		ТаблицаРегистраСостоянийСегментовЗубов.Индексы.Добавить("Регистратор");
		
		ДокументыРегистраторы = РезультатыЗапроса[2].Выгрузить().ВыгрузитьКолонку("Регистратор");
		
		// Проходимся по всей таблице регистра состояний зубов
		// Заменяем нужные строки и замещаем все записи в регистре
		Для Каждого Регистратор Из ДокументыРегистраторы Цикл
			
			ДвиженияРегистратора = ТаблицаРегистраСостоянийСегментовЗубов.НайтиСтроки(Новый Структура("Регистратор", Регистратор));
			
			НаборЗамещающихЗаписей = РегистрыСведений.стомСостоянияЗубов.СоздатьНаборЗаписей();
			НаборЗамещающихЗаписей.Отбор.Регистратор.Установить(Регистратор);
			
			Для Каждого СтрокаВыгрузки Из ДвиженияРегистратора Цикл
				
				Если ЗубыВКарте.Получить(СтрокаВыгрузки.ЗубВКарте) <> Неопределено
					И ЗначениеЗаполнено(СтрокаВыгрузки.СегментВЗубе)
				Тогда
					
					ОтборПравилаЗамены.ЗубВКарте = СтрокаВыгрузки.ЗубВКарте;
					ОтборПравилаЗамены.ЗаменяемыйСегмент = СтрокаВыгрузки.СегментВЗубе;
					
					ПравилаЗамены = ТаблицаСоответствийЗамены.НайтиСтроки(ОтборПравилаЗамены);
					Если ПравилаЗамены.Количество() <> 0 Тогда
						НовыйСегмент = ПравилаЗамены[0].НовыйСегмент;
						СтрокаВыгрузки.СегментВЗубе = НовыйСегмент;
						СтрокаВыгрузки.СегментИдентификатор = НовыйСегмент.УникальныйИдентификатор(); 
					КонецЕсли;
				КонецЕсли;
				
				НоваяЗамещающаяЗапись = НаборЗамещающихЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗамещающаяЗапись, СтрокаВыгрузки,,"СегментИдентификатор");
				
			КонецЦикла;	// Цикл по строке движения.
			
			НаборЗамещающихЗаписей.Записать();
			
			// Замена в таб.части документа
			ПриемОбъект = Регистратор.ПолучитьОбъект();
			Если Ложь Тогда ПриемОбъект = Документы.Прием.СоздатьДокумент() КонецЕсли;
			
			// Исправление таблицы состояний в приёме
			Для Каждого СтрокаТЧ Из ПриемОбъект.стомУстановленныеСостояния Цикл
				Если ЗаменяемыеСегменты.Найти(СтрокаТЧ.СегментВЗубе) <> Неопределено Тогда
					ОтборПравилаЗамены.ЗубВКарте = СтрокаТЧ.ЗубВКарте;
					ОтборПравилаЗамены.ЗаменяемыйСегмент = СтрокаТЧ.СегментВЗубе;
					ПравилаЗамены = ТаблицаСоответствийЗамены.НайтиСтроки(ОтборПравилаЗамены);
					Если ПравилаЗамены.Количество() <> 0 Тогда
						НовыйСегмент = ПравилаЗамены[0].НовыйСегмент;
					КонецЕсли;
					
					СтрокаТЧ.СегментВЗубе = НовыйСегмент;
				КонецЕсли;
			КонецЦикла;
						
			// Исправление таблицы Работ (оказанные услуги) в приёме
			Для каждого СтрокаТЧ Из ПриемОбъект.Работы Цикл
				Если ЗаменяемыеСегменты.Найти(СтрокаТЧ.СегментВЗубе) <> Неопределено Тогда
					ОтборПравилаЗамены.ЗубВКарте = СтрокаТЧ.ЗубВКарте;
					ОтборПравилаЗамены.ЗаменяемыйСегмент = СтрокаТЧ.СегментВЗубе;
					ПравилаЗамены = ТаблицаСоответствийЗамены.НайтиСтроки(ОтборПравилаЗамены);
					Если ПравилаЗамены.Количество() <> 0 Тогда
						НовыйСегмент = ПравилаЗамены[0].НовыйСегмент;
					КонецЕсли;
					
					СтрокаТЧ.СегментВЗубе = НовыйСегмент;
				КонецЕсли;	
			КонецЦикла;
			
			// Исправление таблицы Диагнозы в приёме
			Для каждого СтрокаТЧ Из ПриемОбъект.Диагнозы Цикл
				Если ЗаменяемыеСегменты.Найти(СтрокаТЧ.СегментВЗубе) <> Неопределено Тогда
					ОтборПравилаЗамены.ЗубВКарте = СтрокаТЧ.ЗубВКарте;
					ОтборПравилаЗамены.ЗаменяемыйСегмент = СтрокаТЧ.СегментВЗубе;
					ПравилаЗамены = ТаблицаСоответствийЗамены.НайтиСтроки(ОтборПравилаЗамены);
					Если ПравилаЗамены.Количество() <> 0 Тогда
						НовыйСегмент = ПравилаЗамены[0].НовыйСегмент;
					КонецЕсли;
					
					СтрокаТЧ.СегментВЗубе = НовыйСегмент;
				КонецЕсли;
			КонецЦикла;
			
			ПриемОбъект.ОбменДанными.Загрузка = Истина;
			ПриемОбъект.ДополнительныеСвойства.Вставить("НеДелатьПроверокПриЗаписи");
			ПриемОбъект.Записать();
			
		КонецЦикла; // Цикл по регистратору.
		
		ЗафиксироватьТранзакцию();
	КонецЦикла; // Цикл транзакций.
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	// 3. Оставшиеся приемы
	
	// Обход документов, которые были пропущены при обходе регистра состояний зубов
	// Стоит сразу после для того, чтоб выкинуть из запроса приемы из ДокументыРегистраторы (заполнен по регистру состояний зубов)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Прием.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Работы.СегментВЗубе В (&ЗаменяемыеСегменты)
	|			ИЛИ Прием.Диагнозы.СегментВЗубе В (&ЗаменяемыеСегменты)
	|			ИЛИ Прием.стомУстановленныеСостояния.СегментВЗубе В (&ЗаменяемыеСегменты)"
	;
	Запрос.УстановитьПараметр("ЗаменяемыеСегменты",ЗаменяемыеСегменты);
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Данные для отслеживания транзакций
	сч = 0;
	ОперацийВТранзакции = 500;
	
	//Обходим выборку оставшихся приёмов
	НачатьТранзакцию();
	Пока Выборка.Следующий() Цикл
		
		ПриемОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если Ложь Тогда ПриемОбъект = Документы.Прием.СоздатьДокумент() КонецЕсли;
		
		// Исправление таблицы состояний в приёме
		Для Каждого СтрокаТЧ Из ПриемОбъект.стомУстановленныеСостояния Цикл
			Если ЗаменяемыеСегменты.Найти(СтрокаТЧ.СегментВЗубе) <> Неопределено Тогда
				ОтборПравилаЗамены.ЗубВКарте = СтрокаТЧ.ЗубВКарте;
				ОтборПравилаЗамены.ЗаменяемыйСегмент = СтрокаТЧ.СегментВЗубе;
				ПравилаЗамены = ТаблицаСоответствийЗамены.НайтиСтроки(ОтборПравилаЗамены);
				Если ПравилаЗамены.Количество() <> 0 Тогда
					НовыйСегмент = ПравилаЗамены[0].НовыйСегмент;
				КонецЕсли;
				
				СтрокаТЧ.СегментВЗубе = НовыйСегмент;
			КонецЕсли;
		КонецЦикла;
		
		// Исправление таблицы Работ (оказанные услуги) в приёме
		Для каждого СтрокаТЧ Из ПриемОбъект.Работы Цикл
			Если ЗаменяемыеСегменты.Найти(СтрокаТЧ.СегментВЗубе) <> Неопределено Тогда
				ОтборПравилаЗамены.ЗубВКарте = СтрокаТЧ.ЗубВКарте;
				ОтборПравилаЗамены.ЗаменяемыйСегмент = СтрокаТЧ.СегментВЗубе;
				ПравилаЗамены = ТаблицаСоответствийЗамены.НайтиСтроки(ОтборПравилаЗамены);
				Если ПравилаЗамены.Количество() <> 0 Тогда
					НовыйСегмент = ПравилаЗамены[0].НовыйСегмент;
				КонецЕсли;
				
				СтрокаТЧ.СегментВЗубе = НовыйСегмент;
			КонецЕсли;	
		КонецЦикла;
		
		// Исправление таблицы Диагнозы в приёме
		Для каждого СтрокаТЧ Из ПриемОбъект.Диагнозы Цикл
			Если ЗаменяемыеСегменты.Найти(СтрокаТЧ.СегментВЗубе) <> Неопределено Тогда
				ОтборПравилаЗамены.ЗубВКарте = СтрокаТЧ.ЗубВКарте;
				ОтборПравилаЗамены.ЗаменяемыйСегмент = СтрокаТЧ.СегментВЗубе;
				ПравилаЗамены = ТаблицаСоответствийЗамены.НайтиСтроки(ОтборПравилаЗамены);
				Если ПравилаЗамены.Количество() <> 0 Тогда
					НовыйСегмент = ПравилаЗамены[0].НовыйСегмент;
				КонецЕсли;
				
				СтрокаТЧ.СегментВЗубе = НовыйСегмент;
			КонецЕсли;
		КонецЦикла;
		
		ПриемОбъект.ОбменДанными.Загрузка = Истина;
		ПриемОбъект.ДополнительныеСвойства.Вставить("НеДелатьПроверокПриЗаписи");
		ПриемОбъект.Записать();
		
		Если сч = ОперацийВТранзакции Тогда
			сч = 0;
			ЗафиксироватьТранзакцию();
			НачатьТранзакцию();
		Иначе
			сч = сч + 1;
		КонецЕсли;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	// 4. Планы лечения
	
	// Перебор регистра плана лечения. Поскольку на самом объекте документа не хранится план лечения
	// (он заполняется при создании на сервере) - то замене подвергается только регистр.
	Для СчИтераций = 1 По 25000 Цикл
		
		НачатьТранзакцию();
		
		// Запрос по 
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
			|	ПланыЛечения.ДокументРегистратор КАК Регистратор
			|ПОМЕСТИТЬ Регистраторы
			|ИЗ
			|	РегистрСведений.ПланыЛечения КАК ПланыЛечения
			|ГДЕ
			|	ПланыЛечения.СегментВЗубе В(&ЗаменяемыеСегменты)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПланыЛечения.ПервичныйПрием КАК ПервичныйПрием,
			|	ПланыЛечения.ИдентификаторЭлемента КАК ИдентификаторЭлемента,
			|	ПланыЛечения.ВидЭлемента КАК ВидЭлемента,
			|	ПланыЛечения.Номенклатура КАК Номенклатура,
			|	ПланыЛечения.ПорядокЭлемента КАК ПорядокЭлемента,
			|	ПланыЛечения.ДокументРегистратор КАК ДокументРегистратор,
			|	ПланыЛечения.Дата КАК Дата,
			|	ПланыЛечения.Сотрудник КАК Сотрудник,
			|	ПланыЛечения.Количество КАК Количество,
			|	ПланыЛечения.удалитьДокументРегистратор КАК удалитьДокументРегистратор,
			|	ПланыЛечения.ЗубВКарте КАК ЗубВКарте,
			|	ПланыЛечения.СегментВЗубе КАК СегментВЗубе,
			|	ПланыЛечения.Конструкция КАК Конструкция,
			|	ПланыЛечения.Сумма КАК Сумма,
			|	ПланыЛечения.ПриемовВДень КАК ПриемовВДень,
			|	ПланыЛечения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ПланыЛечения.ДатаОкончания КАК ДатаОкончания,
			|	ПланыЛечения.Дозировка КАК Дозировка,
			|	ПланыЛечения.Комментарий КАК Комментарий
			|ИЗ
			|	РегистрСведений.ПланыЛечения КАК ПланыЛечения
			|ГДЕ
			|	ПланыЛечения.ДокументРегистратор В
			|			(ВЫБРАТЬ
			|				Регистраторы.Регистратор
			|			ИЗ
			|				Регистраторы)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Регистраторы.Регистратор КАК ДокументРегистратор
			|ИЗ
			|	Регистраторы КАК Регистраторы";
			
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		// Если нечего перезаписывать - прекращаем работу
		Если РезультатыЗапроса[1].Пустой() Тогда
			Прервать;
		КонецЕсли;	
		
		ТаблицаРегистраПлановЛечения = РезультатыЗапроса[1].Выгрузить();
		ТаблицаРегистраПлановЛечения.Индексы.Добавить("ДокументРегистратор");
		
		ДокументыРегистраторы = РезультатыЗапроса[2].Выгрузить().ВыгрузитьКолонку("ДокументРегистратор");
		
		// Заменяем нужные строки и замещаем все записи в регистре
		Для Каждого Регистратор Из ДокументыРегистраторы Цикл
			
			ДвиженияРегистратора = ТаблицаРегистраПлановЛечения.НайтиСтроки(Новый Структура("ДокументРегистратор", Регистратор));
			
			НаборЗамещающихЗаписей = РегистрыСведений.ПланыЛечения.СоздатьНаборЗаписей();
			НаборЗамещающихЗаписей.Отбор.ДокументРегистратор.Установить(Регистратор);
			
			Для Каждого СтрокаВыгрузки Из ДвиженияРегистратора Цикл
				
				Если ЗубыВКарте.Получить(СтрокаВыгрузки.ЗубВКарте) <> Неопределено
					И ЗначениеЗаполнено(СтрокаВыгрузки.СегментВЗубе)
				Тогда
					
					ОтборПравилаЗамены.ЗубВКарте = СтрокаВыгрузки.ЗубВКарте;
					ОтборПравилаЗамены.ЗаменяемыйСегмент = СтрокаВыгрузки.СегментВЗубе;
					
					ПравилаЗамены = ТаблицаСоответствийЗамены.НайтиСтроки(ОтборПравилаЗамены);
					Если ПравилаЗамены.Количество() <> 0 Тогда
						НовыйСегмент = ПравилаЗамены[0].НовыйСегмент;
						СтрокаВыгрузки.СегментВЗубе = НовыйСегмент;
					КонецЕсли;
				КонецЕсли;
				
				НоваяЗамещающаяЗапись = НаборЗамещающихЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗамещающаяЗапись, СтрокаВыгрузки);
				
			КонецЦикла;	// Цикл по строке движения.
			
			НаборЗамещающихЗаписей.Записать();
						
		КонецЦикла; // Цикл по регистратору.
		
		ЗафиксироватьТранзакцию();
	КонецЦикла; // Цикл транзакций.
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
